
import StarEffect from "../../../../mgm/newmainmenu/StarEffect"
import GmConfig from "../../../../config/GmConfig"
import BaseClass from "../../../../engine/BaseClass"
import XButtonEx2 from "../../../../engine/control/XButtonEx2"
import M3DFast from "../../../../engine/graphics/M3DFast"
import XAnima from "../../../../engine/graphics/XAnima"
import GmPlay from "../../../../engtst/mgm/GmPlay"
import GmProtocol from "../../../../engtst/mgm/GmProtocol"
import XStat from "../../../../engtst/mgm/XStat"
import DrawMode from "../../../../engtst/mgm/frame/DrawMode"
import FormatString from "../../../../engtst/mgm/frame/format/FormatString"
import PromptActivity from "../../../../engtst/mgm/gameing/help/ang/PromptActivity"
import GmMe from "../../../../engtst/mgm/gameing/me/GmMe"
import MyMission from "../../../../engtst/mgm/gameing/me/mission/MyMission"
export default class SelectSchool extends BaseClass{

	 constructor( ani)
	{
		super();
		var i;
		this.iW=800;
		this.iH=550;
		this.iX=(GmConfig.SCRW-this.iW)/2;
		this.iY=(GmConfig.SCRH-this.iH)/2;
		
		this.btn_school=new Array(3);//
		for(i=0;i<3;i++)
		{
			this.btn_school[i]=new XButtonEx2(GmPlay.xani_nui2);
			this.btn_school[i].InitButton(SelectSchool._ADetail[4][i+GmMe.me.iRace*3][0]);
			this.btn_school[i].sName="";
		}
		this.se=new StarEffect();
		this.se.Init3(0, 0, 50, 50);
		
		this.btn_go=new XButtonEx2(GmPlay.xani_nui2);
		this.btn_go.InitButton("按钮1_110");
		this.btn_go.sName="前往";
		
		this.btn_close=new XButtonEx2(GmPlay.xani_nui2);
		this.btn_close.InitButton("关闭按钮");
	}
	Draw()
	{
		var i;
		var offx,offy,offh;
		DrawMode.new_bigframe(this.iX, this.iY, this.iW, this.iH);
		offx=this.iX+30;
		offy=this.iY+30;
		offh=80+60+25;
		DrawMode.new_framein(offx,offy,this.iW-60,offh);
		
		M3DFast.gi().DrawTextEx(offx+30, offy+30+50, "选择门派：", 0xff003e57, 40, 101, 1, 1, 0, 0, -2);
		for(i=0;i<3;i++)
		{
			this.btn_school[i].Move(offx+30+i*130+200, offy+30, 100, 100);
			this.btn_school[i].Draw();
			if(this.iSchoolPoint==i+GmMe.me.iRace*3 && this.iSchoolPoint>=0)
			{
				this.se.Logic();
				this.se.Draw(this.btn_school[i].iX+50, this.btn_school[i].iY+50);
			}
		}
		
		offy+=offh+20;
		offh=this.iH-offh-60-20;
		DrawMode.new_framein(offx,offy,this.iW-60,offh);
		
		if(this.iSchoolPoint>=0)
		{
			FormatString.gi().FormatEx("#c003e57"+SelectSchool._ADetail[4][this.iSchoolPoint][1], this.iW-60-40, 25, 0, 0, 30);
			FormatString.gi().Draw(offx+20,offy+20);
			
			this.btn_go.Move(this.iX+this.iW-30-20-110,this.iY+this.iH-30-20-52,110,52);
			this.btn_go.Draw();
		}
		
		this.btn_close.Move(this.iX+this.iW-35, this.iY-25, 60, 60);
		this.btn_close.Draw();
	}
	ProcTouch( msg, x, y)
	{
		var i;
		for(i=0;i<3;i++)
		{
			if(this.btn_school[i].ProcTouch(msg, x, y))
			{
				if(this.btn_school[i].bCheck())
				{//成功
					this.iSchoolPoint=i+GmMe.me.iRace*3;
				}
				return true;
			}
		}
		if(this.iSchoolPoint>=0)
		{
			if(this.btn_go.ProcTouch(msg, x, y))
			{
				if(this.btn_go.bCheck())
				{//
					GmProtocol.gi().s_ChangeMapNew(2,34+this.iSchoolPoint);
					if(MyMission.m.bCheckDoing(138))
					{
						GmProtocol.gi().s_FinishMission(0,138,0,0);
					}
					XStat.gi().PopStat(1);
				}
				return true;
			}
		}
		if(this.btn_close.ProcTouch(msg, x, y))
		{
			if(this.btn_close.bCheck())
			{
				XStat.gi().PopStat(1);
			}
			return true;
		}
		return false;
	}
}

SelectSchool.Open=function()
{
	XStat.gi().PushStat(XStat.GS_SELECTSCHOOL);
}

SelectSchool._ADetail=[
	[["门派任务","人物等级>=10级#e10级加入门派后，找门派师傅领取任务，每天的前两轮（会员三轮）任务获得双倍奖励。"],
	["为民除害","人物等级>=10级#e在[西阳城守卫]处领取，任务完成后会获得大量的经验奖励。"],
	["每日赛跑","人物等级>=20级#e在[临淄城]的[田忌]处领取，完成可获得大量经验和金钱奖励，并获得一个三级草药。每天前十名更能额外获得道具奖励。#e任务可自动寻路完成"],
	["护法任务","人物等级>=20级#e在[咸阳]的[商鞅]处领取任务，完成获得大量的经验和金钱，10次为一轮，完成每轮的第十次任务可获得制作装备的材料。"],
	["追捕强盗","人物等级>=20级#e可以在[郢城]的[栾千盛]处领取追捕强盗任务，要求至少3人组队才能领取，完成获取经验金钱奖励，10次为一轮，第10次队长必定获得装备制造图纸，其他队员有几率获得道具奖励。"],
	["擂台切磋","在西阳城中间的擂台，跟其他玩家切磋一下，不管输赢都会获得2点活跃哦。"],
	["手艺任务","在郢城的铁匠接取任务，完成任务后会获得大量的经验和金钱，以及高熟练的打造手艺！"],
	["押镖任务","人物等级>=20级#e可前往[临淄城]找[程镖头]领取押镖任务，完成获得大量金钱奖励，并有一定几率获取阵法书，还有可能获得红包（#cff0000里面有200元宝哦#o）。"],
	["消灭山贼","人物等级>=30级#e每天整点，在随机野外地图刷出10只山贼，至少3人组队才能与山贼战斗，打败山贼获得大量的经验和金钱奖励，并有较大几率获得藏宝图。"],
	["帮派青龙","人物等级>=20级#e在[郢城]的[帮派总管]处加入帮派，进入帮派领地，在帮派的领地里面去找青龙堂总管，领取任务，完成任务可获得大量的经验、金钱和帮贡"],
	["帮派玄武","人物等级>=20级#e在帮派的领地里面去找玄武堂总管，领取任务，完成任务可获得大量的经验、金钱和帮贡（帮贡可在学院点帮派修炼）"],
	["帮派朱雀","人物等级>=20级#e在帮派的领地里面去找朱雀堂总管，领取任务，完成任务可获得大量的经验、金钱和帮贡，在第10次并能获取丹方，是炼丹的必备品。"]],

	[["门派闯关","每周四20:00点在[咸阳]或[临淄]的[门派活动使者]处领取任务，然后根据任务挑战门派护卫。每闯过一关都有丰厚的奖励，闯关速度最快的队伍更有高等级稀有宝石领取。"],
	["保卫西阳","每周一20:00点在大禹水道，平原山陵，函谷关，太行山四个地图刷新怪物向西阳城进攻，玩家阻挡怪物，阻止怪物进入西阳城，打败怪物会获得丰厚的奖励，保卫西阳城成功，在西阳城更有稀有宝箱出现。"],
	["比武大会","每周五中午12点~周六中午12点，玩家可以在[咸阳]的[比武接引人]报名，周六和周日下午13点~15点之间分别进行两场比武，比武获胜方可领取宝箱，即使失败也有其他丰厚奖励"],
	["帮派之战","每周五，周六，周日的19点~20点在[咸阳]的[帮战接引先锋]处进入帮战场地（帮主需提前报名），获胜帮派的成员将会获得100点帮贡和大量经验，并在帮战场地内刷出大量宝箱"],
	["封印叔叔","在挖宝时，有一定几率挖出妖怪叔叔，玩家组队去封印妖怪叔叔，会获得稀有的宝石和大量的经验金钱。"],
	["挑战嚣张","每天系统会在城市中刷新出4种嚣张妖怪（有点嚣张、比较嚣张、很嚣张、太嚣张）每种怪物每天可挑战一次，挑战成功，有几率获取丰厚的奖励（如高级宠物技能包）"],
	["战队竞技","在[咸阳]的[神威将军]处创建战队后，战队队长可以挑战比自己排名高的战队，挑战胜利可以提升战队排名。排名越靠前，战队每日声望增长越多"],
	["跑环","玩家在郢城的吉祥处领取跑环任务，完成跑环任务可获得相应等级的装备图纸。"]],
	
	//新手玩法
	[["门派任务","人物等级>=10级#e10级加入门派后，找门派师傅领取任务，每天的前两轮（会员三轮）任务获得双倍奖励。"],
	["为民除害","人物等级>=10级#e在[西阳城守卫]处领取，任务完成后会获得大量的经验奖励。"],
	["每日赛跑","人物等级>=10级#e在[临淄城]的[田忌]处领取，完成获得大量经验和金钱奖励，并获得一个三级草药。每天前十名更能额外获得道具奖励。#e任务可自动寻路完成"],
	["世界抢答","人物等级>=10级#e每隔一段时间，系统会发出一道题目，可在世界频道回答，最先答对的两名玩家各获得一颗宝石，并从前二十名答对的玩家中抽取4名给予66666铜币奖励"],
	["智者答题","无等级要求#e在各城市，每隔一段时间会随机出现一个智者，第一个答对智者问题的人可获得经验和金钱奖励，并有一定几率获得一颗宝石"],
	["押镖任务","人物等级>=20级#e可前往[临淄城]找[程镖头]领取押镖任务，完成获得大量金钱奖励，并有一定几率获取阵法书，还有可能获得红包（#cff0000里面有200元宝哦#o）。"],
	["追捕强盗","人物等级>=20级#e可以在[郢城]的[栾千盛]处领取追捕强盗任务，要求至少3人组队才能领取，完成获取经验金钱奖励，10次为一轮，第10次队长必定获得装备制造图纸，其他队员有几率获得道具奖励。"],
	["护法任务","人物等级>=20级#e在[咸阳]的[商鞅]处领取任务，完成获得大量的经验和金钱，10次为一轮，完成每轮的第十次任务可获得制作装备的材料。"],
	["帮派任务","人物等级>=20级#e在[郢城]的[帮派总管]处加入帮派，进入帮派领地，在帮派领地内可领取各种帮派任务，完成获得经验、金钱和帮贡，不同任务还有额外奖励"]],
	//高手进阶
	[["消灭山贼","人物等级>=30级#e每天整点，在随机野外地图刷出10只山贼，至少3人组队才能与山贼战斗，打败山贼获得大量的经验和金钱奖励，并有较大几率获得藏宝图。"],
	["封印叔叔","在挖宝时，有一定几率挖出妖怪叔叔，玩家组队去封印妖怪叔叔，会获得稀有的宝石和大量的经验金钱。"],
	["挑战嚣张","每天系统会在城市中刷新出4种嚣张妖怪（有点嚣张、比较嚣张、很嚣张、太嚣张）每种怪物每天可挑战一次，挑战成功，有几率获取丰厚的奖励（如高级宠物技能包）"],
	["门派闯关","每周二20:00点在[咸阳]或[临淄]的[门派活动使者]处领取任务，然后根据任务挑战门派护卫。每闯过一关都有丰厚的奖励，闯关速度最快的队伍更有高等级稀有宝石领取。"],
	["保卫西阳","每周三20:00点在大禹水道，平原山陵，函谷关，太行山四个地图刷新怪物向西阳城进攻，玩家阻挡怪物，阻止怪物进入西阳城，打败怪物会获得丰厚的奖励，保卫西阳城成功，在西阳城更有稀有宝箱出现。"],
	["比武大会","每周五中午12点~周六中午12点，玩家可以在[咸阳]的[比武接引人]报名，周六和周日下午13点~15点之间分别进行两场比武，比武获胜方可领取宝箱，即使失败也有其他丰厚奖励"],
	["帮派之战","每周五，周六，周日的19点~20点在[咸阳]的[帮战接引先锋]处进入帮战场地（帮主需提前报名），获胜帮派的成员将会获得100点帮贡和大量经验，并在帮战场地内刷出大量宝箱"],
	["战队竞技","在[咸阳]的[神威将军]处创建战队后，战队队长可以挑战比自己排名高的战队，挑战胜利可以提升战队排名。排名越靠前，战队每日声望增长越多"],
	["战队秘境","战队队长可在[咸阳]的[神威将军]处开启秘境，需要消耗战队声望，战队秘境里掉落大量的稀有道具，以及宠物进阶所必须的封印兽魂"],
	["副本挑战","人物等级>=40级#e在[咸阳]的[副本官]处创建自己的副本，也可申请加入其他玩家创建的副本。副本会掉落大量的稀有物品道具。"],
	["跑环","人物等级>=50级#e在[郢城]的[吉祥]处领取跑环任务，完成跑环任务可获得大量经验快速升级，每50环还可获得相应等级的装备图纸和手艺。"],
	["师徒任务","在[临淄]的[慎到]处拜师或收徒，师徒二人组队在慎到处领取师徒任务，任务会给与大量的经验和金钱奖励。徒弟出师后，师傅可获得宠物修炼积分"]],
	//门派介绍
	[["剑侠居","要求种族：人族#e门派特色：物理攻击型，具有超高物理输出、点杀能力。 #e推荐加点：5力、4力1敏、4力1体。#e●剑侠居算是最热门的一个门派，容易上手，输出可观，是练级不可缺少的一员，相对的装备也比较贵，后期的剑侠居，拥有较高的暴击率，在竞技玩法中更是点杀的一大利器。"],
	["茅棚坞","要求种族：人族#e门派特色：辅助型，具有高速度和强大的封印能力。 #e推荐加点：3敏2体、2敏3体、2敏2体1耐。#e●引以为傲的是速度，同样配置的情况下，先出手的绝对是茅棚，速度决定了竞技玩法的主动权，轮轴术也能很好的利用在卡敏战术中，迷雾让己方的胜率几率更大化，练级时，一个奇谋也能加快脚步。"],
	["庐医崖","要求种族：人族#e门派特色：辅助型、具有强大的加血和救人技能。#e推荐加点：3体2耐、2体2耐1法、2体2敏1耐。#e●作为七国里唯一的纯奶妈，具有强大的加血技能和救人技能，是各种高端任务、活动，竞技玩法不可缺少的一员。"],
	["溶洞","要求种族：魔族#e门派特色：法术攻击型，具有最高法系伤害。#e推荐加点：5法、4法1体#e●输出比封神高，但是目标数量比封神少，总伤害算起来反而不如封神了，不过做为七国的两大法系门派，溶洞更注重于多手段控制，相比封神来说没那么单调。"],
	["鬼谷","要求种族：魔族#e门派特色：辅助型，具有强大的封印和解封技能。#e推荐加点：3敏2体、2敏3体。#e●作为封系，鬼谷最大的特点就是可以为己方解封，还有增加封印几率的增益，在竞技玩法中也是一大强将。"],
	["武安阁","要求种族：魔族#e门派特色：物理攻击型、具有强大的物理攻击能力。#e推荐加点：5力、4力1敏、4力1体。#e●两大物理伤害的武安阁，点杀能力一点都不比剑侠居低，乱舞后还不用休息，单缺点就是太消耗蓝，续航能力不足。在竞技玩法和练级中，与剑侠居有同等的地位。"],
	["封神台","要求种族：仙族#e门派特点：法术伤害型、具有强大群秒技能#e推荐加点：5法、4法1体#e●两大法系之一，练级最受欢迎的门派，当然你要有一定的装备，不然小心免费回城。七国里的NPC怪物理攻击较高，所以很多玩家都注重于物理防御，导致在竞技玩法中，法系的输出也相当的可观。"],
	["仙人洞","要求种族：仙族#e门派特点：辅助攻击型，具有固定伤害和持续恢复，以及各种增益。#e推荐加点：3体2耐、2体2耐1速#e●在前期，玩家伤害普遍不高，血量也低的时候，仙人洞的固定伤害就是一大利器，又肉又能输出，是前期练级最重要的一员。"],
	["神女峰","要求种族：仙族#e门派特点：辅助攻击型，具有单体高伤、复活、持续蓝恢复、封印#e推荐加点：4力1体、3力2法(攻击型)、3体2耐(辅助型)#e●神女是又能输出又能复活又能封的门派，绝对可以省下奶妈与控制的位置，多加一个输出，大大加快练级速度。"]],
	//实力提升
	[["人物升级",""],
	["装备打造",""],
	["修炼提升",""],
	["宠物进阶",""],
	["坐骑养成",""]],
	//辅助能力
	[["辅助技能",""],
	["剧情技能",""],
	["家园种植",""]],
];